АлогистикТест2/src/DataProcessors/ГрафическоеОтображениеСушКомплекса/ГрафическоеОтображениеСушКомплекса.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ГрафическоеОтображениеСушКомплекса</name>
</mdclass:DataProcessor>

АлогистикТест2/src/InformationRegisters/алк_СостояниеСушильныхКамер/алк_СостояниеСушильныхКамер.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>алк_СостояниеСушильныхКамер</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Неисправна</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>СушильнаяКамера</name>
    <type>
      <types>CatalogRef.алк_Штабели</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

АлогистикТест2/src/DataProcessors/ГрафическоеОтображениеСушКомплекса/Forms/ФормаРедактированияСостоянияКамеры/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Период = Параметры.Период;
	ПериодДоРедактирования = Параметры.Период;
	Камера = Параметры.Камера;
	Склад = Параметры.Склад;
	Неисправна = Параметры.Неисправна; 
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура Сохранить(Команда) 
	Если НЕ ИзмененияСохранены(ПериодДоРедактирования,Камера,Неисправна,Период) Тогда 
		Возврат;
	КонецЕсли;
	Закрыть();
КонецПроцедуры 

&НаСервереБезКонтекста
Функция ИзмененияСохранены(ПериодДоРедактирования,Камера,Неисправна,ПериодПослеРедактирования) 
	
	//поменяем период   
	ПерезаписатьСостояниеКамеры(ПериодДоРедактирования,Камера,Неисправна,ПериодПослеРедактирования);
	//\\ 
	
	ЗаписьДо = ВернутьСостояниеДо(ПериодПослеРедактирования,Камера);
	ЗаписьПосле = ВернутьСостояниеПосле(ПериодПослеРедактирования,Камера);
	
	ПрошелПроверку = Истина;
	//проверяем повторы записей
	Если ЗаписьДо <> Неопределено Тогда 
		Если ЗаписьДо.Неисправна = Неисправна Тогда 
			ПрошелПроверку = Ложь;
		КонецЕсли;		
	КонецЕсли;
	
	Если ЗаписьПосле <> Неопределено Тогда 
		Если ЗаписьПосле.Неисправна = Неисправна Тогда 
			ПрошелПроверку = Ложь;
		КонецЕсли; 
		Если НЕ Неисправна И ЗаписьПосле.Неисправна = Истина И ЗаписьДо = Неопределено Тогда  
			ПрошелПроверку = Ложь;
		КонецЕсли;
	КонецЕсли;  
	//\\	

	//проверка, что запись была правильная
	Если ПрошелПроверку Тогда  
		Сообщить("Изменения по состоянию внесены успешно!");
		Возврат Истина;
	КонецЕсли; 
	//\\ 
	
	//вернем период наазд  
	ПерезаписатьСостояниеКамеры(ПериодПослеРедактирования,Камера,Неисправна,ПериодДоРедактирования);
	//\\
	Сообщить("Ошибка! Нарушен хронологический порядок. Невозможно поменять период.");
	
	Возврат Ложь;
	
КонецФункции   

&НаСервереБезКонтекста
Процедура ПерезаписатьСостояниеКамеры(ПериодДоРедактирования,Камера,Неисправна,ПериодПослеРедактирования) 
	Запись = РегистрыСведений.алк_СостояниеСушильныхКамер.СоздатьМенеджерЗаписи();
	Запись.Период = ПериодДоРедактирования; 
	Запись.СушильнаяКамера = Камера;
	Запись.Неисправна = Неисправна;
	Запись.Прочитать();
	Запись.Период = ПериодПослеРедактирования;
	Запись.Записать(); 
КонецПроцедуры

&НаСервереБезКонтекста
Функция ВернутьСостояниеДо(Период,СушильнаяКамера)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	алк_СостояниеСушильныхКамер.Период КАК Период,
	               |	алк_СостояниеСушильныхКамер.СушильнаяКамера,
	               |	алк_СостояниеСушильныхКамер.Неисправна
	               |ИЗ
	               |	РегистрСведений.алк_СостояниеСушильныхКамер КАК алк_СостояниеСушильныхКамер
	               |ГДЕ
	               |	алк_СостояниеСушильныхКамер.Период < &Период
	               |	И алк_СостояниеСушильныхКамер.СушильнаяКамера = &СушильнаяКамера
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Период УБЫВ";
	Запрос.УстановитьПараметр("Период",Период);
	Запрос.УстановитьПараметр("СушильнаяКамера",СушильнаяКамера);
	РезЗ = Запрос.Выполнить();
	
	Если РезЗ.Пустой() Тогда 
		Возврат Неопределено;
	КонецЕсли;
	
	Выборка = РезЗ.Выбрать();
	Пока Выборка.Следующий() Цикл 
		Возврат Выборка;
	КонецЦикла;
КонецФункции   

&НаСервереБезКонтекста
Функция ВернутьСостояниеПосле(Период,СушильнаяКамера)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	алк_СостояниеСушильныхКамер.Период КАК Период,
	               |	алк_СостояниеСушильныхКамер.СушильнаяКамера,
	               |	алк_СостояниеСушильныхКамер.Неисправна
	               |ИЗ
	               |	РегистрСведений.алк_СостояниеСушильныхКамер КАК алк_СостояниеСушильныхКамер
	               |ГДЕ
	               |	алк_СостояниеСушильныхКамер.Период > &Период
	               |	И алк_СостояниеСушильныхКамер.СушильнаяКамера = &СушильнаяКамера
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Период";
	Запрос.УстановитьПараметр("Период",Период); 
	Запрос.УстановитьПараметр("СушильнаяКамера",СушильнаяКамера);
	РезЗ = Запрос.Выполнить();
	
	Если РезЗ.Пустой() Тогда 
		Возврат Неопределено;
	КонецЕсли;
	
	Выборка = РезЗ.Выбрать();
	Пока Выборка.Следующий() Цикл 
		Возврат Выборка;
	КонецЦикла;
КонецФункции
